# BuiltInFailures.CutFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures Class
BuiltInFailures Class Members See Also
---
Failures about Cut.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CutFailures
```

Visual Basic
---
```text
Public NotInheritable Class CutFailures
```

Visual C++
---
```text
public ref class CutFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CutFailures
# See Also
BuiltInFailures..::..CutFailures Members
Autodesk.Revit.DB Namespace